v2206/solver_ADMFoam/multi_gasGenComparison/ADM/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setFields

touch channel_ADM.foam

runApplication $(getApplication)



#------------------------------------------------------------------------------
